module PhraseRemovable
  extend ActiveSupport::Concern

  PHRASES_TO_REMOVE = %w[
    の実施に係る支援事業者企画提案（プロポーザル）の公募について
    の事業者選定に関する公募型プロポーザルを実施します
    に係る提案競技（公募型プロポーザル）の実施について
    に係る企画提案公募（プロポーザル）の実施について
    の事業者を公募型プロポーザル方式により募集します
    企画提案競技（プロポーザル方式）の実施について
    企画提案競技(プロポーザル方式)を実施します
    に関する公募型プロポーザル実施のお知らせ
    にかかる公募型プロポーザルの実施について
    に関する公募型プロポーザルの実施について
    公募型プロポーザル方式による企画提案募集
    に係る公募型プロポーザルの実施について
    に係る公募型プロポーザルを実施します。
    にかかる公募型プロポーザルを実施します
    に係る企画運営業務委託者の募集について
    に係る公募型プロポーザルの実施について
    に係る公募型プロポーザルを実施します。
    に関する公募型プロポーザルを実施します
    に伴うに伴う企画提案競技実施について
    にかかる公募型企画提案の実施について
    に関する公募型プロポーザルを行います
    に係る企画運営業務委託者を募集します
    に係る公募型プロポーザルを実施します
    をプロポーザル方式により募集します
    における企画提案協議の実施について
    の公募型プロポーザルの実施について
    公募型プロポーザルの実施について
    の公募型プロポーザルを実施します
    の条件付一般競争入札を行います。
    公募型プロポーザル実施のお知らせ
    に係る企画提案プロポーザルの公告
    に係る企画提案競技の実施について
    公募型プロポーザルを実施します。
    公募型プロポーザルを実施します
    に係る企画提案競技を実施します
    プロポーザル審査の実施について
    にかかる技術提案の募集について
    に係る公募型プロポーザルの実施
    に係る〜企画提案募集について
    のプロポーザル参加業者を公募
    のプロポーザル参加業者を募集
    に係る企画運営業務委託の募集
    に係る技術提案の募集について
    に係る計画の公募を開始します
    企画提案競技の実施について
    に係る企画提案募集について
    に係る受託者の募集について
    に係る事務局公募のお知らせ
    プロポーザルの実施について
    における公募型プロポーザル
    の公募型プロポーザルの実施
    の一般競争入札を行います
    を一般競争入札に付します
    公募型プロポーザルの実施
    に係る条件付一般競争入札
    （企画競争に関する公告）
    に係る公募型プロポーザル
    の企画提案を募集します
    企画提案募集のお知らせ
    （公募型プロポーザル）
    【公募型プロポーザル】
    提案競技の実施について
    に係る企画運営業務委託
    の企画提案募集について
    にかかる企画提案の募集
    企画提案募集について
    に係る一般競争入札
    に係るプロポーザル
    事業者公募について
    に係る企画提案募集
    の公募を開始します
    の募集を開始します
    がスタートします！
    に係る公募につい
    にかかる提案競技
    の募集について
    の企画提案募集
    の実施に伴う〜
    に係る企画競争
    の一般競争入札
    に係る提案競技
    の入札者を公募
    を実施します
    を実施します
    を開始します
    （公示）
    の実施
  ].freeze

  included do
    def remove_phrase(value)
      sorted_phrases = PHRASES_TO_REMOVE.sort_by { |phrase| -phrase.length }
      sorted_phrases = sorted_phrases.map { |phrase| Regexp.escape(phrase) }
      value.gsub(/#{sorted_phrases.join('|')}/, '')
    end
  end
end
